

#include "system_paramter.h"
#include "calendar.h"


const unsigned char Month[13]={0,31,28,31,30,31,30,31,31,30,31,30,31};	  //每月的天数
  
/************************************************************************************************* 
* 函数功能	: 设定时钟        
*
* 参数			:                                              
*                               
* 返回			:                                        
*        			                                   
* 备注			:                                                
*                                                                        
**************************************************************************************************/ 
void RTCSetClock(unsigned int sec)
{
	RtcSec = sec;
}

/************************************************************************************************* 
* 函数功能	: 读取当前时钟值        
*
* 参数			:                                              
*                               
* 返回			:                                        
*        			                                   
* 备注			:                                                
*                                                                        
**************************************************************************************************/ 
void RTCReadClock(unsigned int *sec)
{
	*sec = RtcSec;
}

/************************************************************************************************* 
* 函数功能	: 闰年判断        
*
* 参数			: year 年份                                             
*                               
* 返回			: 闰年返回1；反之返回0；                                       
*        			                                   
* 备注			:                                                
*                                                                        
**************************************************************************************************/ 
unsigned char IsLeap(unsigned short year)
{
	if(((year%100==0)&&(year%400==0))||
	   ((year%100!=0) && (year%4==0))) 
		return 1;
	else
		return 0;
}

/************************************************************************************************* 
* 函数功能	: 返回指定年、月的天数        
*
* 参数			: year 年份; mon 月份                                            
*                               
* 返回			: 返回指定月分的天数；                                       
*        			                                   
* 备注			:                                                
*                                                                        
**************************************************************************************************/ 
unsigned char DayCntInMonth(unsigned char mon,unsigned short year)
{
	if(mon<1)
		mon=12;
	if(mon>12)
		mon=1;
	if((mon==2)&&(IsLeap(year)==1))
		return 29;
	else 
		return	Month[mon];
}

/************************************************************************************************* 
* 函数功能	: 在当前日期上增加一天       
*
* 参数			: day 当前日期                                          
*                               
* 返回			: 返回新日期                                     
*        			                                   
* 备注			:                                                
*                                                                        
**************************************************************************************************/ 
RTCDAY	NewDay(RTCDAY day)
{
	day.daily++;
	if(day.daily>DayCntInMonth(day.month,day.year)){day.daily=1;day.month++;}
	if(day.month>12){day.month=1;day.year++;}
	return day;
}

/************************************************************************************************* 
* 函数功能	: 在当前日期上加既定天数   
*
* 参数			: day 当前日期；num 需增加的天数；                                          
*                               
* 返回			: 返回增加以后的日期                               
*        			                                   
* 备注			:                                                
*                                                                        
**************************************************************************************************/ 
RTCDAY DateFromDayCnt(int num,RTCDAY day)
{
	int i=0;
	for(i=0;i<num;i++)
	{
		day.daily++;
		day.day_in_week++;
		day.day_in_week %= 7;
		if(day.daily>DayCntInMonth(day.month,day.year)){day.daily=1;day.month++;}
		if(day.month>12){day.month=1;day.year++;}
	}
	return day;
}

/************************************************************************************************* 
* 函数功能	: 在当前的日期上减少一天      
*
* 参数			: day 当前日期；num 需增加的天数；                                           
*                               
* 返回			: 返回减少以后的日期                                     
*        			                                   
* 备注			:                                                
*                                                                        
**************************************************************************************************/ 
RTCDAY	BackDay(RTCDAY day)
{
	day.daily--;
	if(day.daily==0){day.daily=DayCntInMonth(day.month-1,day.year);day.month--;}
	if(day.month==0){day.month=12;day.year--;}
	return day;
}
/************************************************************************************************* 
* 函数功能	: 两个不同日期之间的天数   
*
* 参数			: day1 日期1； day2 日期2；                                         
*                               
* 返回			: 返回天数                                 
*        			                                   
* 备注			:                                                
*                                                                        
**************************************************************************************************/ 
unsigned int NumOfDayToDay(RTCDAY day_s,RTCDAY day2)
{
	unsigned int i=0;
	if(day_s.year>day2.year)
	{
		return 0;
	}
	else 
	{
		if(day_s.year==day2.year)
		{
			if(day_s.month>day2.month)
				return 0;
			else 
			{
				if(day_s.month==day2.month)
				{
					if(day_s.daily>=day2.daily)
						return 0;
				}
			}
		}
	}
	do
	{
		day_s.daily++;  
		i++;
		if(day_s.daily>DayCntInMonth(day_s.month,day_s.year))
		{
			day_s.daily=1;
			day_s.month++;
		}
		if(day_s.month>12)
		{
			day_s.month=1;
			day_s.year++;
		}
	}while(!((day_s.year==day2.year)&&(day_s.month==day2.month)&&(day_s.daily==day2.daily)));
	return i;
}
/************************************************************************************************* 
* 函数功能	: N天N小时N分N秒 有多少秒
*
* 参数			: day_cnt 天数；T 时间 时分秒；                                      
*                               
* 返回			: 返回秒数                              
*        			                                   
* 备注			:                                                
*                                                                        
**************************************************************************************************/ 
unsigned int SecCntFromTime(unsigned short day_cnt,RTCTIME T)
{
	unsigned int n;
	unsigned int i;

	n = day_cnt*SEC_DAY;
	i = (unsigned int)(T.hour)*SEC_HOUR;
	n+=i;
	i = (T.minute)*60;
	n+=i;
	n += T.second;
	return (n);
}
/************************************************************************************************* 
* 函数功能	: 给定的秒数代表的时分秒
*
* 参数			: 秒数                                    
*                               
* 返回			: 返回时分秒                          
*        			                                   
* 备注			:                                                
*                                                                        
**************************************************************************************************/ 
RTCTIME SecCntToTime(unsigned int num)
{
	RTCTIME	T;
	num=num%SEC_DAY;
	T.hour=num/SEC_HOUR; 
	num=num%SEC_HOUR;
	T.minute=num/60;  
	num=num%60;
	T.second=num;
	return T;
}
/************************************************************************************************* 
* 函数功能	: 设置标准时间
*
* 参数			:                                  
*                               
* 返回			:                         
*        			                                   
* 备注			: 固定在 2015/01/01                                            
*                                                              
**************************************************************************************************/ 
void  RTC_SetStandTime(void)
{		
	StandDate.year=2015;
	StandDate.month=1;
	StandDate.daily=1;
	StandDate.day_in_week = 4;
}
/************************************************************************************************* 
* 函数功能	: 设置系统时间、实时时间
*
* 参数			:                                  
*                               
* 返回			:                         
*        			                                   
* 备注			: 获取从标准时间到实时时间相差的秒数，做RTC计数的基数。                                         
*                                                              
**************************************************************************************************/ 
void RTC_SetTime(void)
{	   	
	int tianshu;

	tianshu = NumOfDayToDay(StandDate,SysDate); //天数=日期-日期
	
	RtcSec = SecCntFromTime(tianshu,SysTime);//秒数=天数，时间
//	MinutesCntInDay = (SysTime.hour)*60+SysTime.minute;
}
/************************************************************************************************* 
* 函数功能	: 从RTC技术的时间，相对标准时间计算实时时间
*
* 参数			:                                  
*                               
* 返回			:                         
*        			                                   
* 备注			:                                       
*                                                              
**************************************************************************************************/ 
void RTC_GetTime(void)
{		
	SysTime = SecCntToTime(RtcSec);//时间=秒数	
}
/************************************************************************************************* 
* 函数功能	: 从RTC技术的时间，相对标准时间计算实时时间
*
* 参数			:                                  
*                               
* 返回			:                         
*        			                                   
* 备注			:                                       
*                                                              
**************************************************************************************************/ 
void RTC_GetDate(void)
{
	unsigned short day_cnt;	
	day_cnt = RtcSec/SEC_DAY;	
	SysDate = DateFromDayCnt(day_cnt,StandDate);//日期=日期+天数	
}
/************************************************************************************************* 
* 函数功能	: 设置实时时间和标准时间
*
* 参数			:                                  
*                               
* 返回			:                         
*        			                                   
* 备注			:                                       
*                                                              
**************************************************************************************************/ 
void RTC_SetDefaultTime(void)
{
	SysDate.daily = 3;
	SysDate.day_in_week = 4;
	SysDate.month = 12;
	SysDate.year = 2015;
	
	SysTime.hour 	= 8;
	SysTime.minute = 59;
	SysTime.second = 58;	
}
